[
  {
    "path": "posts/welcome/",
    "title": "Data Makeover 1 for Data Visualisation",
    "description": "This is my data makeover 1 for ISSS608",
    "author": [
      {
        "name": "ZHONG PING",
        "url": "https://www.linkedin.com/in/ping-zhong/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\nIn this article, we will rethink and rework a data visualisation of “Merchandise of Trade of Top Six Trading Countries, 2019-2020” provided by prof Kam.\r\nThe data is provided by Department of Statisticcs, Singapore DOS.\r\nThis is the original visualisation: \r\nContent: \r\nCritique of Visualization\r\n1.1 Clarity\r\n1.2 Aesthetic\r\nAlternative Design\r\n2.1 Draft\r\n2.2 Improvement\r\nProposed Visualization\r\nStep-by-step Guide\r\nDrived Insights\r\n1. Critique of Visualization\r\n1.1 Clarity\r\n1.Monetary unit of the value is not clear\r\nAll values and y axis are not labeled with monetary unit. We can’t find from the figure whether the unit of the amount is the US dollar, Singapore dollar, or local currency. To avoid uncleanness, It should be marked that all denominated by Singapore dollars.\r\n2.X axis scale is not corresponding with data \r\nThe data is monthly export and import value, while the x axis is only marked by year. Although we can infer the x-axis scale is month from the amount of data and the title of x axis, we need to label them more rigorously. Besides, it’s better if Japan have the same x axis mark as the rest five graph.\r\n\r\n3. Area graph is not the best way\r\nThe vasualisation is using area graph to show the data of export and import, which is not the best way.The overlapped area charts are very tough to read as the format becomes complex. And in this case, there is a lot overlapped areas.\r\n4. There is no data source\r\nIt is always important to mention the source to give reader a understanding of the source of the data, without which the graph would have been meaningless.\r\n1.2 Aesthetic\r\n1.The legend and graph color should be more clear\r\nIt is hard to read the import and export data in graph because the color of them is not that distinguished and the overlapped area is too confused. The color should be more different or the legend should be more clear to mark overlapped area also.\r\n2.The diffident scale of first and secondary y axis makes its hard to read the balance of trades\r\n\r\nIt is not clear enough to see the difference between export and import, because the axis scale of first and secondary axis is different. For example, if you have a glance at the graph of merchandise trade of Hong Kong, you might think this region’s export and import value is quit equal. However the export volume of HK is ten times the import volume.\r\n3. The graph has no emphasis\r\nThe graph contains all info of six countries but we don’t really know the focus of this graph. We should use innovations or colors to emphasize the key parts and delete unnecessary information.\r\n2. Alternative Design\r\n2.1 draft\r\nthe design is drawn as a draft: \r\n2.2 Improvement\r\n1. Add necessary information\r\nEdit the title of this visualisation to make it more clear by adding the monetary unit of this chart and the data source.\r\n2. Edit Y axis\r\nSynchronize first and secondary axis for each country, so now it is clearly to find out the deference of export and import data visually. And to compare the data among countries, I fixed Y axis range of six graphs.\r\n3. Edit X axis\r\nChange the display of the x axis by using format “mmm yyy” to show the month year. Delete unnecessary x title..\r\n4. Change graph type to line chart\r\nChange the graph to line chart to avoid the confusing overlapped area.\r\n5. Add new measure Balance of Trade\r\nCalculating by “exports-imports”, a new measure named “Balance of Trade” is added to visualization. Because it is an important criterion to notice when talking about imports and exports. To clarify trends of BoT, I add a bar chart to show BoT to graph.\r\n6. Color the graph\r\nUse yellow and green to color the exports and imports. And to make it more clear to notice the positive or negative of BoT, I color it red when its negative and color it blue while its positive.\r\n7. Add annotations\r\nTo help read this graph, I add some annotations to emphasize the key take away of this graph. For example, highlight the consistent negative BoT of Taiwan, and explained this is trade deficit.\r\n3. Proposed Visualization\r\nIn this data make over, the poposed visualisation is posted here .\r\n4. Step-by-step Guide\r\n1.Data preparation\r\nFirst we download the data from DOS and use Excel to do basic data cleansing to find our target data. Here is our cleansed data look like:  There is in total 25 rows, including head, and 13 columns.\r\n2.Import data to Tableau\r\nOpen Tableau, create a new file and drag our data to the panel. \r\n3. Create a basic graph\r\nFirst we try to visualise data of Japan. Create a worksheet and rename it to “Japan”.\r\nDrag the Tables “Time” to columns and change its format to Month.\r\nThen drag the table “Japan(Export)” to Rows and drag table “Japan(Import)” to y-axis as below. Tableau will automatically generate a line graph. \r\n4. Create a calculated field\r\nGo to Analysis-Create calculated fields, and create a measure named “Japan(Balance of Trade)” and formula as “[Japan(Export)]-[Japan(Import)]” as below: \r\nAnd then drag the generated table “Japan(Balance of Trade)” to the secondary y axis as showed below:  After that, you should have three-line graph as below. And click the secondary y axis, click “Synchronize Axis” to synchronize the first(left) and secondary(right) axis to make our graph more direct. Since two y axis have same scale, we don’t need them both. Click “Show Header” to hide the secondary y axis.  We want have a bar chart of BoT instead of line chart to show the absolute number of BoT, so go to marks-Sum(Japan(Balance of Trade)), choose Bar. You will have a similar graph as below:  Now the graph seems nice, but we will color the bar chart to beautify it.\r\nDrag “Japan(Balance of Trade)” to Color.\r\n And edit color to change it to “Red-Blue Diverging” and 2 stepped color. 5. Edit x axis\r\nDelete the title of X axis also. Change the format of x axis to mmm yyy.\r\n\r\n6. Edit y axis\r\nIt is very clear that our y axis represents values so we delete the title.\r\n\r\nThen change the format of y axis to “Currency(Custom)” as blow:\r\n\r\n7. Edit Tooltip\r\nChange it as showed below for clarify.\r\n\r\n8. Create other five worksheet\r\nFollowing step 3 to 7, create same worksheet for other five countries/regions.\r\n9. Create a dashboard\r\nNow we have five separate worksheet, creating a dash board and draging those six worksheet on panel. Edit the title and note, we can have a our data visualisation:\r\n\r\n5. Drived Insights\r\nAlthough these six countries are the largest trading countries, the differences between countries are still large. For example, from 2019 to 2020, China has the largest export volume. Its export volume in a single month is as high as 7.97 billion, while Japan’s highest export volume is only 2.31 billion. \r\nThe import and export situation of each country is also very different. For example, Taiwan is with a typical trade deficit, that is, the net export value is less than 0, while Hong Kong is with a typical trade surplus, that is, the net export value is greater than 0. But we also need to know that the volume of the BoT cannot represent the quality of a region’s economy.\r\nThe import and export situation of some countries is relatively stable, while the situation of some countries have huge changes or fluctuations. For example, the United State’s BoT turned positive from negative after Apr 2020, due to a sharp drop of imports.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T16:52:40+08:00",
    "input_file": "welcome.knit.md"
  }
]
